<?php 
function maiuscula ($cadeias){ 
    $cadeias = mb_strtoupper($cadeias, mb_detect_encoding($cadeias));
//    $cadeias = strtoupper($cadeias); 
    $mai = array(0=>"á", 1=>"à", 2=>"ã", 3=>"â", 4=>"ä", 5=>"é", 6=>"è", 7=>"ê", 
                 8=>"ë", 9=>"í", 10=>"ì", 11=>"î", 12=>"ï", 13=>"ó", 14=>"ò", 
                 15=>"ô", 16=>"õ", 17=>"ö", 18=>"ú", 19=>"ù", 20=>"û", 21=>"ü", 22=>"ç", 
                 ); 
                 
    $min = array(0=>"Á", 1=>"À", 2=>"Ã", 3=>"Â", 4=>"Ä", 5=>"É", 6=>"È", 7=>"Ê", 
                 8=>"Ë", 9=>"Í", 10=>"Ì", 11=>"Î", 12=>"Ï", 13=>"Ó", 14=>"Ò", 
                 15=>"Ô", 16=>"Õ", 17=>"Ö", 18=>"Ú", 19=>"Ù", 20=>"Û", 21=>"Ü", 22=>"Ç", 
                 ); 
                 
    for ($i=0; $i<23; $i++){ 
 //       $cadeias = str_replace($mai[$i], $min[$i], $cadeias); 
    } 
    return $cadeias; 
} 
?>
